Курс_Бухгалтерские_задачи/src/Documents/СписаниеОсновныхСредств/СписаниеОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеОсновныхСредств</name>
  <registerRecords>InformationRegister.СвойстваОсновныхСредств</registerRecords>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/InformationRegisters/СвойстваОсновныхСредств/СвойстваОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОсновныхСредств</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОсновногоСредства</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериальноОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Курс_Бухгалтерские_задачи/src/Enums/СостоянияОсновногоСредства/СостоянияОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОсновногоСредства</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
</mdclass:Enum>

Курс_Бухгалтерские_задачи/src/Documents/СписаниеОсновныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере(Период, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваОсновныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	РегистрСведений.СвойстваОсновныхСредств.СрезПоследних(&Период, ) КАК СвойстваОсновныхСредствСрезПоследних
		|ГДЕ
		|	СвойстваОсновныхСредствСрезПоследних.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОсновногоСредства.Используется);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОС = Новый Массив;
	ТаблицаОС = Новый ТаблицаЗначений;
	ТаблицаОС.Колонки.Добавить("ОС",,"ОС");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОС.Добавить(ВыборкаДетальныеЗаписи.ОсновноеСредство);
		НоваяСтрокаТЗ = ТаблицаОС.Добавить();
		НоваяСтрокаТЗ.ОС = ВыборкаДетальныеЗаписи.ОсновноеСредство;
	КонецЦикла;
	
	Возврат МассивОС;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	МассивОС = ЗаполнитьНаСервере(Объект.Дата, Объект.Организация);
	
	Для каждого ОС Из МассивОС Цикл
	
		СтрокаОС = Объект.ОсновныеСредства.Добавить();
		СтрокаОС.ОсновноеСредство = ОС;
	
	КонецЦикла;
	
КонецПроцедуры
